In [2]:
import pandas as pd
import numpy as np
import glob

In [11]:
allxlsx = glob.glob('/Users/franckatteaka/Desktop/cours/Semester III/ML_for_finance/Data/*.xlsx')
csv = glob.glob('/Users/franckatteaka/Desktop/cours/Semester III/ML_for_finance/Data/*yields_raw.csv')

## Yield data cleaning

In [37]:
yields_raw = pd.read_csv(csv[0],sep = ";",skiprows = 3,parse_dates = True,index_col = 0 )

In [52]:
# remove exchange closed days
yields = yields_raw[yields_raw["Value"] == yields_raw["Value"] ]

In [94]:
yields = yields.replace('10J0','10J').copy()

In [132]:
yields.head()

            D0  Value
Date
1991-01-03  1J  8.105
1991-01-03  2J  7.339
1991-01-03  3J  6.944
1991-01-03  4J  6.752
1991-01-03  5J  6.660

In [95]:
yields['D0'].value_counts()

15J    6153
10J    6153
9J     6153
3J     6153
20J    6153
6J     6153
8J     6153
4J     6153
5J     6153
2J     6153
7J     6153
1J     6153
30J    5718
Name: D0, dtype: int64

In [62]:
dates = pd.Series(yields.index.date)

13

In [126]:
tab = pd.DataFrame(dates.value_counts() == 12 )

In [118]:
max_date = max(tab[tab[0] == True].index)
max_date.s

datetime.date(1997, 12, 22)

In [128]:
yields[yields.index.date > max_date]['D0'].value_counts()

15J    5718
10J    5718
9J     5718
3J     5718
30J    5718
20J    5718
6J     5718
8J     5718
4J     5718
5J     5718
2J     5718
7J     5718
1J     5718
Name: D0, dtype: int64

In [129]:
yields_clean = yields[yields.index.date > max_date]
yields_clean

## Economic data cleaning

In [137]:
allxlsx

['/Users/franckatteaka/Desktop/cours/Semester III/ML_for_finance/Data/kof_data_eco_sent_raw.xlsx',
 '/Users/franckatteaka/Desktop/cours/Semester III/ML_for_finance/Data/kof_data_baro_raw.xlsx',
 '/Users/franckatteaka/Desktop/cours/Semester III/ML_for_finance/Data/kof_data_mcp_raw.xlsx.xlsx']

In [141]:
df_eco_raw = pd.read_excel(allxlsx[0],parse_dates = True,index_col = 0 )

In [144]:
df_eco_raw.columns = ['ch','eu']

In [158]:
df_eco_raw.dropna()

                    ch     eu
date
2007-04-01  117.499994  112.3
2007-05-01  116.797739  112.6
2007-06-01  117.108608  112.5
2007-07-01  117.698923  111.9
2007-08-01  117.843179  110.9
...                ...    ...
2020-06-01   57.700856   74.9
2020-07-01   78.252529   81.8
2020-08-01   79.930654   86.8
2020-09-01   80.160834   90.0
2020-10-01   89.618791   90.0

[163 rows x 2 columns]

In [155]:
 date_min = min(df_eco_raw.dropna().index)

In [156]:
df_eco_raw[df_eco_raw.index.date >= date_min]

                    ch     eu
date
2007-04-01  117.499994  112.3
2007-05-01  116.797739  112.6
2007-06-01  117.108608  112.5
2007-07-01  117.698923  111.9
2007-08-01  117.843179  110.9
...                ...    ...
2020-07-01   78.252529   81.8
2020-08-01   79.930654   86.8
2020-09-01   80.160834   90.0
2020-10-01   89.618791   90.0
2020-11-01   88.711065    NaN

[164 rows x 2 columns]

In [157]:
df_eco_raw = df_eco_raw.dropna()